---
kind: method
id: M:Autodesk.Revit.DB.ElementSet.#ctor
source: html/1c1387ca-7f1c-8256-9a33-67505e9b2f49.htm
---
# Autodesk.Revit.DB.ElementSet.#ctor Method

Initializes a new instance of the ElementSet class

## Syntax (C#)
```csharp
public ElementSet()
```